app/controllers/comments_controller.rb

  def create
    # @comment = Comment.new(params[:comment])

    # respond_to do |format|
      # if @comment.save
        # format.html { redirect_to(@comment, :notice => 'Comment was successfully created.') }
        # format.xml  { render :xml => @comment, :status => :created, :location => @comment }
      # else
        # format.html { render :action => "new" }
        # format.xml  { render :xml => @comment.errors, :status => :unprocessable_entity }
      # end
    # end

	@post = Post.find(params[:post_id])
	@comment = @post.comments.create!(params[:comment])
	@comment.user_id = current_user.id
	@comment.save
	redirect_to [@post.group, @post]
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2010-11-01 02:04:19', 'This is a test comment', '2010-11-01 02:04:19', 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 1)