app/controllers/groups_controller.rb

  def index
    @user = User.find(session[:user_id])
    @groups = Group.all
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "groups"

  def show
    @user = User.find(session[:user_id])
    @group = Group.find(params[:id])
    @member = Membership.find_by_user_id_and_group_id(@user.id, @group.id)
	if !@group.users.member?(User.find(session[:user_id]))
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users".id = "memberships".user_id WHERE (("memberships".group_id = 1))

  def join
    Membership.create!(:user_id => session[:user_id], :group_id => params[:id], :permission => "1")
---
INSERT INTO "memberships" ("created_at", "updated_at", "group_id", "user_id") VALUES('2010-11-11 01:37:43', '2010-11-11 01:37:43', NULL, 1)

  def unjoin
    Membership.destroy(Membership.find_by_user_id_and_group_id(session[:user_id], params[:id]))
---
DELETE FROM "memberships" WHERE "id" = 1
SELECT * FROM "memberships" WHERE ("memberships"."user_id" = 1 AND "memberships"."group_id" = '1') LIMIT 1

  def new
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    @user = User.find(session[:user_id])
    @group = Group.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
        Membership.create!(:user_id => session[:user_id], :group_id => @group.id, :permission => "0")
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "description") VALUES('new group name', '2010-11-11 05:33:21', '2010-11-11 05:33:21', 'description
INSERT INTO "permissions" ("name", "created_at", "updated_at", "group_id", "description") VALUES('Admin', '2010-11-01 00:25:58', '2010-11-01 00:25:58', 4, 'Sudo')

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT * FROM "groups" WHERE ("groups"."id" = 7)
DELETE FROM "groups" WHERE "id" = 7