app/controllers/memberships_controller.rb

  def index
    @memberships = Membership.all
---
SELECT * FROM "memberships"

  def show
    @membership = Membership.find(params[:id])
---
SELECT * FROM "memberships" WHERE ("memberships"."id" = 1)

  def edit
    @membership = Membership.find(params[:id])
---
SELECT * FROM "memberships" WHERE ("memberships"."id" = 2)

  def create
    @membership = Membership.new(params[:membership])
    respond_to do |format|
      if @membership.save
---
INSERT INTO "memberships" ("created_at", "updated_at", "group_id", "user_id") VALUES('2010-11-11 00:35:22', '2010-11-11 00:35:22', 1, 1)

  def update
    @membership = Membership.find(params[:id])

    respond_to do |format|
      if @membership.update_attributes(params[:membership])
---
SELECT * FROM "memberships" WHERE ("memberships"."id" = 2)
UPDATE "memberships" SET "updated_at" = '2010-11-11 01:12:54', "group_id" = 6 WHERE "id" = 2