app/controllers/permissions_controller.rb

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
---
  def show
    @permission = Permission.find(params[:id])

INSERT INTO "permissions" ("name", "created_at", "updated_at", "description") VALUES('Owner', '2010-10-31 23:03:15', '2010-10-31 23:03:15', 'does all')
---
  def create
    @permission = Permission.new(params[:permission])

    respond_to do |format|
      if @permission.save