app/controllers/posts_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 5) LIMIT 1

  def show
	@user = User.find(session[:user_id])
    @post = @group.posts.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 5) LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".group_id = 1))

  def new
	@user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 9)

  def edit
    @user = User.find(session[:user_id])
    @post = @group.posts.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".group_id = 1))

  def create
	@user = User.find(session[:user_id])
    @post = @group.posts.build(params[:post])
	@post.user = @user.name
	@post.user_id = @user.id

    respond_to do |format|
      if @post.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "group_id", "user") VALUES('2010-11-11 07:55:44', 'test post', 'this is a test post for groups', '2010-11-11 07:55:44', 1, 'grant')

  def update
    @post = @group.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6 AND ("posts".group_id = 1))

  def destroy
    @post = @group.posts.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 8 AND ("posts".group_id = 1))
DELETE FROM "posts" WHERE "id" = 1