app/controllers/todos_controller.rb

SELECT * FROM "todos" WHERE ("todos"."id" = 2)
UPDATE "todos" SET "updated_at" = '2010-11-01 20:15:23', "finished" = 't' WHERE "id" = 2
---
  def finish
    @todo = @group.todos.find(params[:id])
    @todo.finished = true
    @todo.save

SELECT * FROM "todos" WHERE ("todos"."id" = 2)
UPDATE "todos" SET "updated_at" = '2010-11-01 20:15:26', "finished" = 'f' WHERE "id" = 2
---
  def unfinish
    @todo = @group.todos.find(params[:id])
    @todo.finished = false
    @todo.save

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
---
  def index
    @user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
SELECT * FROM "todos" WHERE ("todos"."id" = 6 AND ("todos".group_id = 1))
---
  def show
    @user = User.find(session[:user_id])
    @todo = @group.todos.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 9)
---
  def new
    @user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
SELECT * FROM "todos" WHERE ("todos"."id" = 7 AND ("todos".group_id = 2))
---
  def edit
    @user = User.find(session[:user_id])
    @todo = @group.todos.find(params[:id])

INSERT INTO "todos" ("created_at", "updated_at", "group_id", "duedate", "task", "finished") VALUES('2010-11-06 04:32:14', '2010-11-06 04:32:14', 1, '2010-11-10', 'some task', 'f')
---
  def create
    @todo = @group.todos.build(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT * FROM "todos" WHERE ("todos"."id" = 8 AND ("todos".group_id = 2))
UPDATE "todos" SET "updated_at" = '2010-11-06 04:38:49', "finished" = 'f' WHERE "id" = 8
---
  def update
    @todo = @group.todos.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])

SELECT * FROM "todos" WHERE ("todos"."id" = 6 AND ("todos".group_id = 1))
DELETE FROM "todos" WHERE "id" = 3
---
  def destroy
    @todo = @group.todos.find(params[:id])
    Newsfeed.create!(:descriptions => 'Todo ' + @todo.id.to_s() + ' destroyed', :group_id => @group.id)
    @todo.destroy