app/controllers/uploads_controller.rb

  def index
    @user = User.find(session[:user_id])
    @uploads = @group.uploads
	if !@group.users.member?(User.find(session[:user_id]))
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users".id = "memberships".user_id WHERE (("memberships".group_id = 5))
SELECT * FROM "uploads" WHERE ("uploads".group_id = 1)

  def show
    @user = User.find(session[:user_id])
    @upload = @group.uploads.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "uploads" WHERE ("uploads"."id" = 2 AND ("uploads".group_id = 1))

  def new
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    @user = User.find(session[:user_id])
    @upload = @group.uploads.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "uploads" WHERE ("uploads"."id" = 2 AND ("uploads".group_id = 1))

  def create
    @upload = @group.uploads.build(params[:upload])

    respond_to do |format|
      if @upload.save
---
INSERT INTO "uploads" ("attachment_file_name", "created_at", "attachment_content_type", "attachment_file_size", "gid", "updated_at", "filename", "description", "attachment_updated_at") VALUES('CarryTrades.pdf', '2010-11-01 08:08:09', 'application/pdf', 654385, 2, '2010-11-01 08:08:09', 'testing file', 'description here', '2010-11-01 08:08:09')

  def destroy
    @upload = @group.uploads.find(params[:id])
    Newsfeed.create!(:descriptions => 'Uplodad ' + @upload.id.to_s() + ' destroyed', :group_id => @group.id)
    @upload.destroy
---
SELECT * FROM "uploads" WHERE ("uploads"."id" = 1 AND ("uploads".group_id = 1))
DELETE FROM "uploads" WHERE "id" = 3