app/controllers/uploads_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1