app/controllers/userlists_controller.rb

  def index
    @userlists = Userlist.all
---
SELECT * FROM "userlists"

  def show
    @userlist = Userlist.find(params[:id])
---
SELECT * FROM "userlists" WHERE ("userlists"."id" = 1)

  def create
    @userlist = Userlist.new(params[:userlist])

    respond_to do |format|
      if @userlist.save
---
INSERT INTO "userlists" ("created_at", "permissionid", "updated_at", "uid") VALUES('2010-10-31 23:30:01', 0, '2010-10-31 23:30:01', 0)