app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def user_manage
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "hash_password", "updated_at") VALUES('kevin', '21739789400.477540658279021', '2010-10-22 02:28:12', 'dbe7dd797bcaa69c4bf7ee6e7679807e9975d7c5', '2010-10-22 02:28:12')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
DELETE FROM "users" WHERE "id" = 4